mc2285/stm32-ntru/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2024 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "usb_device.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

#include <string.h>

#include "usbd_cdc_if.h"
#include "stm32h7xx_hal_hash.h"
#include "stm32h7xx_hal_rng.h"

#include "api.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

#define AT_COMMAND_LENGTH 4
#define N_BENCH 20

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

HASH_HandleTypeDef hhash;

RNG_HandleTypeDef hrng;

/* USER CODE BEGIN PV */

volatile uint8_t USBD_Connected = 0;

char current_buff[64];

__attribute__((section("._ram_d1"))) char rx_buffer[10240], tx_buffer[10240],
    pub_key[CRYPTO_PUBLICKEYBYTES], sec_key[CRYPTO_SECRETKEYBYTES];

uint32_t n_received = 0, n_stored = 0;
uint8_t tr_flag = 0;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_HASH_Init(void);
static void MX_RNG_Init(void);
/* USER CODE BEGIN PFP */

static void schedule_error_message(void)
{
  strcpy(tx_buffer, "ERROR\r\n");
}
static void schedule_ok_message(void)
{
  strcpy(tx_buffer, "OK\r\n");
}
static void schedule_overflow_message(void)
{
  strcpy(tx_buffer, "OVERFLOW\r\n");
}

static int8_t encode_hex_string(char *src, char *out, uint32_t len);
static int8_t expand_hex_string(char *src, char *out, uint32_t len);

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* Enable the CPU Cache */

  /* Enable I-Cache---------------------------------------------------------*/
  SCB_EnableICache();

  /* Enable D-Cache---------------------------------------------------------*/
  SCB_EnableDCache();

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USB_DEVICE_Init();
  MX_HASH_Init();
  MX_RNG_Init();
  /* USER CODE BEGIN 2 */

  memset(rx_buffer, 0, sizeof(rx_buffer));
  memset(tx_buffer, 0, sizeof(tx_buffer));
  memset(current_buff, 0, sizeof(current_buff));
  memset(pub_key, 0, sizeof(pub_key));
  memset(sec_key, 0, sizeof(sec_key));

  // Generate an initial key pair
  crypto_sign_keypair((unsigned char *)pub_key, (unsigned char *)sec_key);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    n_received = CDC_RXQueue_Dequeue(current_buff, sizeof(current_buff));
    if (tr_flag)
    {
      CDC_TransmitString(tx_buffer);
      tr_flag = 0;
    }
    if (n_received == 0)
      continue;
    // Check if the buffer can store expanded hex data
    if (n_stored + n_received < sizeof(rx_buffer))
    {
      memcpy(rx_buffer + n_stored, current_buff, n_received);
      n_stored += n_received;
    }
    else
    {
      n_stored = 0;
      schedule_overflow_message();
      tr_flag = 1;
      continue;
    }
    // Check if we have a complete command
    if (rx_buffer[n_stored - 1] == '\n')
    {
      rx_buffer[n_stored - 1] = '\0';
      if (n_stored >= 2 && rx_buffer[n_stored - 2] == '\r')
      {
        rx_buffer[n_stored - 2] = '\0';
      }
      n_stored = 0;

      // A complete command was received - send a response
      tr_flag = 1;

      /*
       * AT command reference:
       *
       * All commands are case-insensitive
       * Unless otherwise specified, commands return "OK" on success, "ERROR" on failure
       * and "OVERFLOW" on data size issues and receive buffer overflow
       *
       * AT+S <raw_data> signs the <hex_string> and returns the signed data as <hex_string>
       * AT+M <hex_string> sets the private key to the <hex_string> if supported by the algorithm
       * AT+V <hex_string> verifies the <hex_string> signature
       *
       * AT+B signs the pub_key (data signed does not matter, just benchmarking)
       * N_BENCH times and returns the average time in msec as <number_string>
       *
       * AT+I returns info about the currently used algorithm as <string>
       * AT+P returns the currently used public key as <hex_string>
       * AT+K returns the currently used private key as <hex_string>
       * AT+T returns the current HAL_Tick value[msec] as <number_string>; used to estimate performance
       * AT+G generates a new key pair
       *
       * AT+R benchmarks key generation over N_BENCH iterations
       * and returns the average time in msec as <number_string>
       */

      if (strncmp(rx_buffer, "AT+S ", AT_COMMAND_LENGTH + 1) == 0)
      {
        uint64_t len = strlen(rx_buffer + AT_COMMAND_LENGTH + 1);
        if (expand_hex_string(rx_buffer + AT_COMMAND_LENGTH + 1, rx_buffer, len) != 0)
        {
          schedule_error_message();
          continue;
        }
        len /= 2;
        if ((len + CRYPTO_BYTES) * 2 > sizeof(tx_buffer) || len + CRYPTO_BYTES > sizeof(rx_buffer))
        {
          schedule_overflow_message();
          continue;
        }
        crypto_sign((unsigned char *)rx_buffer, &len, (unsigned char *)rx_buffer, len, (unsigned char *)sec_key);
        encode_hex_string(rx_buffer, tx_buffer, len);

