mc2285/stm32-ntru/Core/Src/main.c
        /*
         * For some combinations of input data and keys, the signing function
         * may generate a signature that is invalid. To handle this, we
         * will try to verify the signature and if it fails, we will return an
         * error message.
         */

        if (crypto_sign_open((unsigned char *)rx_buffer, &len, (unsigned char *)rx_buffer, len, (unsigned char *)pub_key) != 0)
        {
          schedule_error_message();
          continue;
        }
      }
      else if (strncmp(rx_buffer, "AT+M ", AT_COMMAND_LENGTH + 1) == 0)
      {
        if (strncmp(CRYPTO_ALGNAME, "NTRU", 4) == 0)
        {
          schedule_error_message();
          continue;
        }
        uint32_t len = strlen(rx_buffer + AT_COMMAND_LENGTH + 1);
        if (len != CRYPTO_SECRETKEYBYTES * 2 ||
            expand_hex_string(rx_buffer + AT_COMMAND_LENGTH + 1, sec_key, len) != 0)
        {
          schedule_overflow_message();
          continue;
        }
        // TODO: Implement public key generation
        schedule_ok_message();
        continue;
      }
      else if (strncmp(rx_buffer, "AT+V ", AT_COMMAND_LENGTH + 1) == 0)
      {
        uint64_t len = strlen(rx_buffer + AT_COMMAND_LENGTH + 1);
        if (len <= CRYPTO_BYTES * 2 || expand_hex_string(rx_buffer + AT_COMMAND_LENGTH + 1, rx_buffer, len) != 0)
        {
          schedule_overflow_message();
          continue;
        }
        len /= 2;
        if (crypto_sign_open((unsigned char *)rx_buffer, &len, (unsigned char *)rx_buffer, len, (unsigned char *)pub_key) != 0)
        {
          schedule_error_message();
          continue;
        }
        else
        {
          schedule_ok_message();
          continue;
        }
      }
      else if (strncmp(rx_buffer, "AT+B", AT_COMMAND_LENGTH) == 0)
      {
        uint64_t len;
        uint32_t start = HAL_GetTick();
        for (uint8_t i = 0; i < N_BENCH; i++)
        {
          // Uses the public key as the data to sign
          crypto_sign((unsigned char *)rx_buffer, &len, (unsigned char *)pub_key, sizeof(pub_key), (unsigned char *)sec_key);
        }
        utoa((HAL_GetTick() - start) / N_BENCH, tx_buffer, 10);
      }
      else if (strncmp(rx_buffer, "AT+I", AT_COMMAND_LENGTH) == 0)
      {
        strcpy(tx_buffer, CRYPTO_ALGNAME);
        strcat(tx_buffer, "\r\n");
        strcat(tx_buffer, "Public key length: ");
        utoa(CRYPTO_PUBLICKEYBYTES, tx_buffer + strlen(tx_buffer), 10);
        strcat(tx_buffer, "\r\n");
        strcat(tx_buffer, "Private key length: ");
        utoa(CRYPTO_SECRETKEYBYTES, tx_buffer + strlen(tx_buffer), 10);
        strcat(tx_buffer, "\r\n");
        strcat(tx_buffer, "Maximum message length: ");
        utoa(sizeof(rx_buffer) / 2 - CRYPTO_BYTES - AT_COMMAND_LENGTH - 1,
             tx_buffer + strlen(tx_buffer), 10);
      }
      else if (strncmp(rx_buffer, "AT+P", AT_COMMAND_LENGTH) == 0)
      {
        encode_hex_string(pub_key, tx_buffer, sizeof(pub_key));
      }
      else if (strncmp(rx_buffer, "AT+K", AT_COMMAND_LENGTH) == 0)
      {
        encode_hex_string(sec_key, tx_buffer, sizeof(sec_key));
      }
      else if (strncmp(rx_buffer, "AT+T", AT_COMMAND_LENGTH) == 0)
      {
        utoa(HAL_GetTick(), tx_buffer, 10);
      }
      else if (strncmp(rx_buffer, "AT+G", AT_COMMAND_LENGTH) == 0)
      {
        crypto_sign_keypair((unsigned char *)pub_key, (unsigned char *)sec_key);
        schedule_ok_message();
        continue;
      }
      else if (strncmp(rx_buffer, "AT+R", AT_COMMAND_LENGTH) == 0)
      {
        uint32_t start = HAL_GetTick();
        for (uint8_t i = 0; i < N_BENCH; i++)
        {
          crypto_sign_keypair((unsigned char *)pub_key, (unsigned char *)sec_key);
        }
        utoa((HAL_GetTick() - start) / N_BENCH, tx_buffer, 10);
      }
      else
      {
        schedule_error_message();
        continue;
      }
      strcat(tx_buffer, "\r\n");
    }
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Supply configuration update enable
   */
  HAL_PWREx_ConfigSupply(PWR_LDO_SUPPLY);

  /** Configure the main internal regulator output voltage
   */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  while (!__HAL_PWR_GET_FLAG(PWR_FLAG_VOSRDY))
  {
  }

  __HAL_RCC_SYSCFG_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE0);

  while (!__HAL_PWR_GET_FLAG(PWR_FLAG_VOSRDY))
  {
  }

  /** Initializes the RCC Oscillators according to the specified parameters
   * in the RCC_OscInitTypeDef structure.
   */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI48 | RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_BYPASS;
  RCC_OscInitStruct.HSI48State = RCC_HSI48_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 1;
  RCC_OscInitStruct.PLL.PLLN = 120;
  RCC_OscInitStruct.PLL.PLLP = 2;
  RCC_OscInitStruct.PLL.PLLQ = 15;
  RCC_OscInitStruct.PLL.PLLR = 2;
  RCC_OscInitStruct.PLL.PLLRGE = RCC_PLL1VCIRANGE_3;
  RCC_OscInitStruct.PLL.PLLVCOSEL = RCC_PLL1VCOWIDE;
  RCC_OscInitStruct.PLL.PLLFRACN = 0;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
   */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2 | RCC_CLOCKTYPE_D3PCLK1 | RCC_CLOCKTYPE_D1PCLK1;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.SYSCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB3CLKDivider = RCC_APB3_DIV2;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV2;
  RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV2;

