mc2285/stm32-ntru/Core/Src/main.c
  /*Configure GPIO pins : PG11 PG13 */
  GPIO_InitStruct.Pin = GPIO_PIN_11 | GPIO_PIN_13;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF11_ETH;
  HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);

  /*Configure GPIO pin : LD2_Pin */
  GPIO_InitStruct.Pin = LD2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LD2_GPIO_Port, &GPIO_InitStruct);

  /* USER CODE BEGIN MX_GPIO_Init_2 */
  /* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */

static int8_t encode_hex_string(char *src, char *out, uint32_t len)
{
  static char _hex_lookup[] = "0123456789ABCDEF";
  while (len--)
  {
    *out++ = _hex_lookup[((unsigned char)*src) >> 4];
    *out++ = _hex_lookup[((unsigned char)*src) & 0x0F];
    src++;
  }
  // Null-terminate the string
  *out = '\0';
  return 0;
}

static inline int8_t hex_char_to_bin(char c, char *out)
{
  if (c >= '0' && c <= '9')
    *out = (c - '0');
  else if (c >= 'A' && c <= 'F')
    *out = (c - 'A') + 10;
  else if (c >= 'a' && c <= 'f')
    *out = (c - 'a') + 10;
  else
  {
    return -1;
  }
  return 0;
}

static int8_t expand_hex_string(char *src, char *out, uint32_t len)
{
  // It is unclear what side to pad
  if (len < 2 || (len % 2) != 0)
    return -1;

  do
  {
    char value = 0;
    if (hex_char_to_bin(*src++, &value) != 0)
    {
      return -1;
    }
    *out = value << 4;
    if (hex_char_to_bin(*src++, &value) != 0)
    {
      return -1;
    }
    *out++ |= value;
  } while (len -= 2);
  return 0;
}

void randombytes_init(unsigned char *entropy_input,
	unsigned char *personalization_string,
	int security_strength)
{
  UNUSED(entropy_input);
  UNUSED(personalization_string);
  UNUSED(security_strength);
}

int randombytes(unsigned char *x, unsigned long long xlen)
{
  uint32_t random;
  uint8_t *ptr = (uint8_t *)&random;
  for (unsigned long long i = 0; i < xlen; i++)
  {
    if (i % 4 == 0)
    {
      HAL_RNG_GenerateRandomNumber(&hrng, &random);
    }
    x[i] = ptr[i % 4];
  }
  return 0;
}

/* USER CODE END 4 */

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  HAL_GPIO_WritePin(LD3_GPIO_Port, LD3_Pin, GPIO_PIN_SET);
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef USE_FULL_ASSERT
/**
 * @brief  Reports the name of the source file and the source line number
 *         where the assert_param error has occurred.
 * @param  file: pointer to the source file name
 * @param  line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
